УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonModules/ФормированиеПечатныхФорм/Module.bsl
&ИзменениеИКонтроль("СоответствиеСтавокИСуммНДС")
Функция смарт_СоответствиеСтавокИСуммНДС()

	СоответствиеСтавокНДС = Новый Соответствие();
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС10,     0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС10_110, 0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС18,     0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС18_118, 0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС20,     0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС20_120, 0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС0,      0); 
	#Вставка
    //++ #4804 смарт: Тимофеева 12.11.2025 / Добавить ставку НДС22
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22,     0);
	СоответствиеСтавокНДС.Вставить(Перечисления.СтавкиНДС.НДС22_122, 0);
	//--++ #4804 смарт: Тимофеева 12.11.2025
	#КонецВставки
	
	Возврат СоответствиеСтавокНДС;

КонецФункции
